rating = input("Введите рейтинг продукта (от 1 до 10): ")
match rating:
    case "9" | "10":
        print("Рейтинг", rating, "Отличный продукт! 🌟 Настоятельно рекомендую!")
    case "7" | "8":
        print("Рейтинг", rating, "Хороший продукт 😊 Рекомендую")
    case "5" | "6":
        print("Рейтинг", rating, "Средний продукт 😐 Можно попробовать")
    case "1" | "2" | "3" | "4":
        print("Рейтинг", rating, "Плохой продукт ❌ Не рекомендую")
    case _:
        print("❌ Ошибка: некорректный рейтинг", rating, "Введите число от 1 до 10")
